; ModuleID = './kernel/sys.ll'
source_filename = "kernel/sys.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm ".globl sys_setpriority"
module asm "\09.set   sys_setpriority,SyS_setpriority"
module asm ".globl sys_getpriority"
module asm "\09.set   sys_getpriority,SyS_getpriority"
module asm ".globl sys_reboot"
module asm "\09.set   sys_reboot,SyS_reboot"
module asm ".globl sys_setregid"
module asm "\09.set   sys_setregid,SyS_setregid"
module asm ".globl sys_setgid"
module asm "\09.set   sys_setgid,SyS_setgid"
module asm ".globl sys_setreuid"
module asm "\09.set   sys_setreuid,SyS_setreuid"
module asm ".globl sys_setuid"
module asm "\09.set   sys_setuid,SyS_setuid"
module asm ".globl sys_setresuid"
module asm "\09.set   sys_setresuid,SyS_setresuid"
module asm ".globl sys_getresuid"
module asm "\09.set   sys_getresuid,SyS_getresuid"
module asm ".globl sys_setresgid"
module asm "\09.set   sys_setresgid,SyS_setresgid"
module asm ".globl sys_getresgid"
module asm "\09.set   sys_getresgid,SyS_getresgid"
module asm ".globl sys_setfsuid"
module asm "\09.set   sys_setfsuid,SyS_setfsuid"
module asm ".globl sys_setfsgid"
module asm "\09.set   sys_setfsgid,SyS_setfsgid"
module asm ".globl sys_times"
module asm "\09.set   sys_times,SyS_times"
module asm ".globl sys_setpgid"
module asm "\09.set   sys_setpgid,SyS_setpgid"
module asm ".globl sys_getpgid"

!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 5.0.1 (tags/RELEASE_500/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5752, globals: !5909)
!3 = !DIFile(filename: "kernel/sys.c", directory: "/diffkemp/kernel/linux-3.10.0-862")
!4 = !{!5, !16, !22, !29, !35, !42, !48, !54, !60, !3814, !3822, !3999, !4046, !4244, !5507, !5639, !5649, !5657, !5662, !5668, !5699, !5725, !5738, !5745}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "trace_reg", file: !6, line: 188, size: 32, elements: !7)
!6 = !DIFile(filename: "include/linux/ftrace_event.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15}
!8 = !DIEnumerator(name: "TRACE_REG_REGISTER", value: 0)
!9 = !DIEnumerator(name: "TRACE_REG_UNREGISTER", value: 1)
!10 = !DIEnumerator(name: "TRACE_REG_PERF_REGISTER", value: 2)
!11 = !DIEnumerator(name: "TRACE_REG_PERF_UNREGISTER", value: 3)
!12 = !DIEnumerator(name: "TRACE_REG_PERF_OPEN", value: 4)
!13 = !DIEnumerator(name: "TRACE_REG_PERF_CLOSE", value: 5)
!14 = !DIEnumerator(name: "TRACE_REG_PERF_ADD", value: 6)
!15 = !DIEnumerator(name: "TRACE_REG_PERF_DEL", value: 7)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "print_line_t", file: !6, line: 137, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21}
!18 = !DIEnumerator(name: "TRACE_TYPE_PARTIAL_LINE", value: 0)
!19 = !DIEnumerator(name: "TRACE_TYPE_HANDLED", value: 1)
!20 = !DIEnumerator(name: "TRACE_TYPE_UNHANDLED", value: 2)
!21 = !DIEnumerator(name: "TRACE_TYPE_NO_CONSUME", value: 3)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "module_state", file: !23, line: 204, size: 32, elements: !24)
!23 = !DIFile(filename: "include/linux/module.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!24 = !{!25, !26, !27, !28}
!25 = !DIEnumerator(name: "MODULE_STATE_LIVE", value: 0)
!26 = !DIEnumerator(name: "MODULE_STATE_COMING", value: 1)
!27 = !DIEnumerator(name: "MODULE_STATE_GOING", value: 2)
!28 = !DIEnumerator(name: "MODULE_STATE_UNFORMED", value: 3)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !30, line: 28, size: 32, elements: !31)
!30 = !DIFile(filename: "include/linux/kobject_ns.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!31 = !{!32, !33, !34}
!32 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0)
!33 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1)
!34 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pid_type", file: !36, line: 6, size: 32, elements: !37)
!36 = !DIFile(filename: "include/linux/pid.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!37 = !{!38, !39, !40, !41}
!38 = !DIEnumerator(name: "PIDTYPE_PID", value: 0)
!39 = !DIEnumerator(name: "PIDTYPE_PGID", value: 1)
!40 = !DIEnumerator(name: "PIDTYPE_SID", value: 2)
!41 = !DIEnumerator(name: "PIDTYPE_MAX", value: 3)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quota_type", file: !43, line: 55, size: 32, elements: !44)
!43 = !DIFile(filename: "include/linux/quota.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!44 = !{!45, !46, !47}
!45 = !DIEnumerator(name: "USRQUOTA", value: 0)
!46 = !DIEnumerator(name: "GRPQUOTA", value: 1)
!47 = !DIEnumerator(name: "PRJQUOTA", value: 2)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "migrate_mode", file: !49, line: 14, size: 32, elements: !50)
!49 = !DIFile(filename: "include/linux/migrate_mode.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!50 = !{!51, !52, !53}
!51 = !DIEnumerator(name: "MIGRATE_ASYNC", value: 0)
!52 = !DIEnumerator(name: "MIGRATE_SYNC_LIGHT", value: 1)
!53 = !DIEnumerator(name: "MIGRATE_SYNC", value: 2)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "page_entry_size", file: !55, line: 298, size: 32, elements: !56)
!55 = !DIFile(filename: "include/linux/mm.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!56 = !{!57, !58, !59}
!57 = !DIEnumerator(name: "PE_SIZE_PTE", value: 0)
!58 = !DIEnumerator(name: "PE_SIZE_PMD", value: 1)
!59 = !DIEnumerator(name: "PE_SIZE_PUD", value: 2)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !62, file: !61, line: 1468, size: 32, elements: !5635)
!61 = !DIFile(filename: "include/linux/sched.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !61, line: 1323, size: 32384, elements: !63)
!63 = !{!64, !67, !69, !76, !78, !79, !85, !86, !88, !90, !91, !92, !93, !94, !95, !96, !97, !101, !193, !207, !210, !220, !222, !223, !224, !225, !234, !241, !242, !249, !3391, !3392, !3398, !3399, !3400, !3401, !3402, !3403, !3404, !3405, !3406, !3407, !3408, !3409, !3410, !3412, !3413, !3414, !3415, !3416, !3417, !3418, !3419, !3420, !3421, !3427, !3428, !3429, !3430, !3431, !3432, !3435, !3436, !3437, !3438, !3439, !3444, !3450, !3451, !3452, !3453, !3454, !3455, !3456, !3457, !3458, !3464, !3466, !3467, !3468, !3469, !3470, !3471, !3478, !4730, !4742, !4743, !4744, !5289, !5316, !5317, !5318, !5319, !5320, !5321, !5322, !5326, !5327, !5329, !5330, !5334, !5335, !5336, !5344, !5345, !5346, !5347, !5348, !5349, !5350, !5354, !5355, !5358, !5361, !5366, !5367, !5371, !5372, !5373, !5374, !5375, !5376, !5377, !5378, !5379, !5380, !5381, !5391, !5392, !5395, !5409, !5410, !5413, !5415, !5416, !5417, !5418, !5419, !5420, !5421, !5422, !5423, !5424, !5425, !5426, !5427, !5428,!
  !5429, !5430, !5433, !5434, !5435, !5436, !5437, !5438, !5439, !5440, !5441, !5442, !5448, !5464, !5465, !5466, !5467, !5468, !5469, !5470, !5488, !5489, !5490, !5491, !5492, !5493, !5500, !5501, !5502, !5536, !5546, !5556, !5557, !5567, !5577, !5587, !5597, !5598, !5605, !5611, !5627, !5628, !5629, !5634}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !62, file: !61, line: 1324, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !66)
!66 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !62, file: !61, line: 1325, baseType: !68, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !62, file: !61, line: 1326, baseType: !70, size: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !71, line: 186, baseType: !72)
!71 = !DIFile(filename: "include/linux/types.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 184, size: 32, elements: !73)
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !72, file: !71, line: 185, baseType: !75, size: 32)
!75 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !62, file: !61, line: 1327, baseType: !77, size: 32, offset: 160)
!77 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !62, file: !61, line: 1328, baseType: !77, size: 32, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "wake_entry", scope: !62, file: !61, line: 1331, baseType: !80, size: 64, offset: 256)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !81, line: 65, size: 64, elements: !82)
!81 = !DIFile(filename: "include/linux/llist.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !80, file: !81, line: 66, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "on_cpu", scope: !62, file: !61, line: 1332, baseType: !75, size: 32, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "last_wakee", scope: !62, file: !61, line: 1333, baseType: !87, size: 64, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "wakee_flips", scope: !62, file: !61, line: 1334, baseType: !89, size: 64, offset: 448)
!89 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "wakee_flip_decay_ts", scope: !62, file: !61, line: 1335, baseType: !89, size: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "wake_cpu", scope: !62, file: !61, line: 1337, baseType: !75, size: 32, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !62, file: !61, line: 1339, baseType: !75, size: 32, offset: 608)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !62, file: !61, line: 1341, baseType: !75, size: 32, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !62, file: !61, line: 1341, baseType: !75, size: 32, offset: 672)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !62, file: !61, line: 1341, baseType: !75, size: 32, offset: 704)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !62, file: !61, line: 1342, baseType: !77, size: 32, offset: 736)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !62, file: !61, line: 1343, baseType: !98, size: 64, offset: 768)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !61, line: 1343, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !62, file: !61, line: 1344, baseType: !102, size: 1536, offset: 832)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !61, line: 1194, size: 1536, elements: !103)
!103 = !{!104, !109, !117, !123, !124, !128, !129, !130, !131, !132, !134, !137, !138, !149, !190, !191, !192}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !102, file: !61, line: 1195, baseType: !105, size: 128)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !61, line: 1141, size: 128, elements: !106)
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !105, file: !61, line: 1143, baseType: !89, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !105, file: !61, line: 1143, baseType: !89, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !102, file: !61, line: 1196, baseType: !110, size: 192, align: 64, offset: 128)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !111, line: 36, size: 192, align: 64, elements: !112)
!111 = !DIFile(filename: "include/linux/rbtree.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!112 = !{!113, !114, !116}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !110, file: !111, line: 37, baseType: !89, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !110, file: !111, line: 38, baseType: !115, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !110, file: !111, line: 39, baseType: !115, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !102, file: !61, line: 1197, baseType: !118, size: 128, offset: 320)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !71, line: 194, size: 128, elements: !119)
!119 = !{!120, !122}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !118, file: !71, line: 195, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !118, file: !71, line: 195, baseType: !121, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !102, file: !61, line: 1198, baseType: !77, size: 32, offset: 448)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !102, file: !61, line: 1200, baseType: !125, size: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !126, line: 25, baseType: !127)
!126 = !DIFile(filename: "include/asm-generic/int-ll64.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!127 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !102, file: !61, line: 1201, baseType: !125, size: 64, offset: 576)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !102, file: !61, line: 1202, baseType: !125, size: 64, offset: 640)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !102, file: !61, line: 1203, baseType: !125, size: 64, offset: 704)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !102, file: !61, line: 1205, baseType: !125, size: 64, offset: 768)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !102, file: !61, line: 1208, baseType: !133, size: 64, offset: 832)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "cfs_rq", scope: !102, file: !61, line: 1210, baseType: !135, size: 64, offset: 896)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "cfs_rq", file: !61, line: 182, flags: DIFlagFwdDecl)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "my_q", scope: !102, file: !61, line: 1212, baseType: !135, size: 64, offset: 960)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "avg", scope: !102, file: !61, line: 1222, baseType: !139, size: 256, offset: 1024)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_avg", file: !61, line: 1146, size: 256, elements: !140)
!140 = !{!141, !143, !144, !145, !148}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "runnable_avg_sum", scope: !139, file: !61, line: 1152, baseType: !142, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !126, line: 22, baseType: !77)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "runnable_avg_period", scope: !139, file: !61, line: 1152, baseType: !142, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "last_runnable_update", scope: !139, file: !61, line: 1153, baseType: !125, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "decay_count", scope: !139, file: !61, line: 1154, baseType: !146, size: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !126, line: 24, baseType: !147)
!147 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "load_avg_contrib", scope: !139, file: !61, line: 1155, baseType: !89, size: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, scope: !102, file: !61, line: 1225, baseType: !150, size: 64, offset: 1280)
!150 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !102, file: !61, line: 1225, size: 64, elements: !151)
!151 = !{!152, !183, !187}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !150, file: !61, line: 1225, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !61, line: 1159, size: 1728, elements: !155)
!155 = !{!156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "wait_start", scope: !154, file: !61, line: 1160, baseType: !125, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "wait_max", scope: !154, file: !61, line: 1161, baseType: !125, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "wait_count", scope: !154, file: !61, line: 1162, baseType: !125, size: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "wait_sum", scope: !154, file: !61, line: 1163, baseType: !125, size: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "iowait_count", scope: !154, file: !61, line: 1164, baseType: !125, size: 64, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "iowait_sum", scope: !154, file: !61, line: 1165, baseType: !125, size: 64, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_start", scope: !154, file: !61, line: 1167, baseType: !125, size: 64, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_max", scope: !154, file: !61, line: 1168, baseType: !125, size: 64, offset: 448)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "sum_sleep_runtime", scope: !154, file: !61, line: 1169, baseType: !146, size: 64, offset: 512)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "block_start", scope: !154, file: !61, line: 1171, baseType: !125, size: 64, offset: 576)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "block_max", scope: !154, file: !61, line: 1172, baseType: !125, size: 64, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "exec_max", scope: !154, file: !61, line: 1173, baseType: !125, size: 64, offset: 704)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "slice_max", scope: !154, file: !61, line: 1174, baseType: !125, size: 64, offset: 768)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations_cold", scope: !154, file: !61, line: 1176, baseType: !125, size: 64, offset: 832)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nr_failed_migrations_affine", scope: !154, file: !61, line: 1177, baseType: !125, size: 64, offset: 896)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nr_failed_migrations_running", scope: !154, file: !61, line: 1178, baseType: !125, size: 64, offset: 960)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nr_failed_migrations_hot", scope: !154, file: !61, line: 1179, baseType: !125, size: 64, offset: 1024)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nr_forced_migrations", scope: !154, file: !61, line: 1180, baseType: !125, size: 64, offset: 1088)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups", scope: !154, file: !61, line: 1182, baseType: !125, size: 64, offset: 1152)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_sync", scope: !154, file: !61, line: 1183, baseType: !125, size: 64, offset: 1216)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_migrate", scope: !154, file: !61, line: 1184, baseType: !125, size: 64, offset: 1280)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_local", scope: !154, file: !61, line: 1185, baseType: !125, size: 64, offset: 1344)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_remote", scope: !154, file: !61, line: 1186, baseType: !125, size: 64, offset: 1408)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_affine", scope: !154, file: !61, line: 1187, baseType: !125, size: 64, offset: 1472)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_affine_attempts", scope: !154, file: !61, line: 1188, baseType: !125, size: 64, offset: 1536)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_passive", scope: !154, file: !61, line: 1189, baseType: !125, size: 64, offset: 1600)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_idle", scope: !154, file: !61, line: 1190, baseType: !125, size: 64, offset: 1664)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__UNIQUE_ID_rh_kabi_hide1225", scope: !150, file: !61, line: 1225, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !150, file: !61, line: 1225, size: 64, elements: !185)
!185 = !{!186}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "rh_reserved1", scope: !184, file: !61, line: 1225, baseType: !89, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, scope: !150, file: !61, line: 1225, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !150, file: !61, line: 1225, elements: !189)
!189 = !{}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "rh_reserved2", scope: !102, file: !61, line: 1228, baseType: !89, size: 64, offset: 1344)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "rh_reserved3", scope: !102, file: !61, line: 1229, baseType: !89, size: 64, offset: 1408)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "rh_reserved4", scope: !102, file: !61, line: 1230, baseType: !89, size: 64, offset: 1472)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !62, file: !61, line: 1345, baseType: !194, size: 576, offset: 2368)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !61, line: 1233, size: 576, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !202, !203, !206}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !194, file: !61, line: 1234, baseType: !118, size: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !194, file: !61, line: 1235, baseType: !89, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !194, file: !61, line: 1236, baseType: !89, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !194, file: !61, line: 1237, baseType: !77, size: 32, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !194, file: !61, line: 1239, baseType: !201, size: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !194, file: !61, line: 1241, baseType: !201, size: 64, offset: 384)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rq", scope: !194, file: !61, line: 1243, baseType: !204, size: 64, offset: 448)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_rq", file: !61, line: 1243, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "my_q", scope: !194, file: !61, line: 1245, baseType: !204, size: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sched_task_group", scope: !62, file: !61, line: 1347, baseType: !208, size: 64, offset: 2944)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "task_group", file: !61, line: 183, flags: DIFlagFwdDecl)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_notifiers", scope: !62, file: !61, line: 1351, baseType: !211, size: 64, offset: 3008)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !71, line: 198, size: 64, elements: !212)
!212 = !{!213}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !211, file: !71, line: 199, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !71, line: 202, size: 128, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !215, file: !71, line: 203, baseType: !214, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !215, file: !71, line: 203, baseType: !219, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_counter", scope: !62, file: !61, line: 1364, baseType: !221, size: 8, offset: 3072)
!221 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "btrace_seq", scope: !62, file: !61, line: 1366, baseType: !77, size: 32, offset: 3104)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !62, file: !61, line: 1369, baseType: !77, size: 32, offset: 3136)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !62, file: !61, line: 1370, baseType: !75, size: 32, offset: 3168)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_allowed", scope: !62, file: !61, line: 1371, baseType: !226, size: 5120, offset: 3200)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !227, line: 14, baseType: !228)
!227 = !DIFile(filename: "include/linux/cpumask.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !227, line: 14, size: 5120, elements: !229)
!229 = !{!230}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !228, file: !227, line: 14, baseType: !231, size: 5120)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 5120, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 80)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !62, file: !61, line: 1386, baseType: !235, size: 256, offset: 8320)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !61, line: 806, size: 256, elements: !236)
!236 = !{!237, !238, !239, !240}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pcount", scope: !235, file: !61, line: 808, baseType: !89, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "run_delay", scope: !235, file: !61, line: 809, baseType: !127, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "last_arrival", scope: !235, file: !61, line: 812, baseType: !127, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "last_queued", scope: !235, file: !61, line: 813, baseType: !127, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !62, file: !61, line: 1389, baseType: !118, size: 128, offset: 8576)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "pushable_tasks", scope: !62, file: !61, line: 1391, baseType: !243, size: 320, offset: 8704)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plist_node", file: !244, line: 85, size: 320, elements: !245)
!244 = !DIFile(filename: "include/linux/plist.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!245 = !{!246, !247, !248}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !243, file: !244, line: 86, baseType: !75, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "prio_list", scope: !243, file: !244, line: 87, baseType: !118, size: 128, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "node_list", scope: !243, file: !244, line: 88, baseType: !118, size: 128, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !62, file: !61, line: 1394, baseType: !250, size: 64, offset: 9024)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !252, line: 394, size: 12608, elements: !253)
!252 = !DIFile(filename: "include/linux/mm_types.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!253 = !{!254, !3080, !3081, !3082, !3083, !3087, !3088, !3089, !3090, !3091, !3092, !3093, !3100, !3101, !3102, !3103, !3104, !3105, !3106, !3107, !3108, !3109, !3110, !3111, !3112, !3113, !3114, !3115, !3116, !3117, !3118, !3119, !3120, !3121, !3122, !3123, !3124, !3125, !3126, !3127, !3131, !3136, !3292, !3293, !3303, !3304, !3316, !3317, !3318, !3319, !3320, !3323, !3324, !3325, !3326, !3327, !3328, !3341, !3342, !3343, !3353, !3363, !3375, !3389, !3390}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !251, file: !252, line: 395, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !252, line: 277, size: 1728, elements: !257)
!257 = !{!258, !259, !260, !261, !262, !263, !264, !265, !273, !274, !283, !284, !287, !3049, !3050, !3051, !3052, !3053, !3068, !3078, !3079}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !256, file: !252, line: 280, baseType: !89, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !256, file: !252, line: 281, baseType: !89, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !256, file: !252, line: 285, baseType: !255, size: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !256, file: !252, line: 285, baseType: !255, size: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !256, file: !252, line: 287, baseType: !110, size: 192, align: 64, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !256, file: !252, line: 295, baseType: !89, size: 64, offset: 448)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !256, file: !252, line: 299, baseType: !250, size: 64, offset: 512)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "vm_page_prot", scope: !256, file: !252, line: 300, baseType: !266, size: 64, offset: 576)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgprot_t", file: !267, line: 386, baseType: !268)
!267 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pgprot", file: !267, line: 386, size: 64, elements: !269)
!269 = !{!270}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "pgprot", scope: !268, file: !267, line: 386, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgprotval_t", file: !272, line: 17, baseType: !89)
!272 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!273 = !DIDerivedType(tag: DW_TAG_member, name: "vm_flags", scope: !256, file: !252, line: 301, baseType: !89, size: 64, offset: 640)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !256, file: !252, line: 314, baseType: !275, size: 256, offset: 704)
!275 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !256, file: !252, line: 308, size: 256, elements: !276)
!276 = !{!277, !282}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "linear", scope: !275, file: !252, line: 312, baseType: !278, size: 256)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !275, file: !252, line: 309, size: 256, elements: !279)
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !278, file: !252, line: 310, baseType: !110, size: 192, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_last", scope: !278, file: !252, line: 311, baseType: !89, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "nonlinear", scope: !275, file: !252, line: 313, baseType: !118, size: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma_chain", scope: !256, file: !252, line: 322, baseType: !118, size: 128, offset: 960)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma", scope: !256, file: !252, line: 324, baseType: !285, size: 64, offset: 1088)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "anon_vma", file: !252, line: 324, flags: DIFlagFwdDecl)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "vm_ops", scope: !256, file: !252, line: 327, baseType: !288, size: 64, offset: 1152)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_operations_struct", file: !55, line: 309, size: 768, elements: !291)
!291 = !{!292, !296, !297, !3009, !3010, !3014, !3020, !3024, !3036, !3040, !3041, !3045}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !290, file: !55, line: 310, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !255}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !290, file: !55, line: 311, baseType: !293, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "fault", scope: !290, file: !55, line: 312, baseType: !298, size: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!75, !255, !301}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_fault", file: !55, line: 274, size: 704, elements: !303)
!303 = !{!304, !305, !306, !307, !2984, !2985, !2991, !2998, !2999, !3000, !3002}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !302, file: !55, line: 275, baseType: !77, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pgoff", scope: !302, file: !55, line: 276, baseType: !89, size: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_address", scope: !302, file: !55, line: 277, baseType: !68, size: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !302, file: !55, line: 279, baseType: !308, size: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !252, line: 45, size: 512, align: 128, elements: !310)
!310 = !{!311, !312, !2929, !2960, !2977}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !309, file: !252, line: 47, baseType: !89, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !309, file: !252, line: 49, baseType: !313, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !315, line: 447, size: 1408, align: 64, elements: !316)
!315 = !DIFile(filename: "include/linux/fs.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!316 = !{!317, !2707, !2749, !2750, !2760, !2761, !2762, !2763, !2764, !2765, !2766, !2924, !2925, !2926, !2927, !2928}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !314, file: !315, line: 448, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !315, line: 593, size: 4672, elements: !320)
!320 = !{!321, !324, !325, !334, !341, !342, !345, !346, !2633, !2634, !2635, !2636, !2637, !2643, !2644, !2645, !2646, !2647, !2648, !2649, !2650, !2651, !2653, !2654, !2655, !2656, !2657, !2658, !2659, !2660, !2665, !2666, !2667, !2668, !2669, !2670, !2671, !2672, !2674, !2675, !2691, !2692, !2693, !2705, !2706}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !319, file: !315, line: 594, baseType: !322, size: 16)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !71, line: 18, baseType: !323)
!323 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !319, file: !315, line: 595, baseType: !323, size: 16, offset: 16)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !319, file: !315, line: 596, baseType: !326, size: 32, offset: 32)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !327, line: 24, baseType: !328)
!327 = !DIFile(filename: "include/linux/uidgid.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !327, line: 22, size: 32, elements: !329)
!329 = !{!330}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !328, file: !327, line: 23, baseType: !331, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !71, line: 31, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !333, line: 48, baseType: !77)
!333 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!334 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !319, file: !315, line: 597, baseType: !335, size: 32, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !327, line: 29, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !327, line: 27, size: 32, elements: !337)
!337 = !{!338}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !336, file: !327, line: 28, baseType: !339, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !71, line: 32, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !333, line: 49, baseType: !77)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !319, file: !315, line: 598, baseType: !77, size: 32, offset: 96)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "i_acl", scope: !319, file: !315, line: 601, baseType: !343, size: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !315, line: 579, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "i_default_acl", scope: !319, file: !315, line: 602, baseType: !343, size: 64, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !319, file: !315, line: 605, baseType: !347, size: 64, offset: 256)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !315, line: 1831, size: 1536, align: 512, elements: !350)
!350 = !{!351, !2492, !2498, !2502, !2506, !2510, !2514, !2518, !2522, !2526, !2530, !2534, !2535, !2539, !2543, !2564, !2585, !2589, !2593, !2597, !2601, !2624, !2629}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !349, file: !315, line: 1832, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!355, !318, !355, !77}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !357, line: 106, size: 1536, elements: !358)
!357 = !DIFile(filename: "include/linux/dcache.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!358 = !{!359, !360, !366, !374, !375, !390, !391, !395, !426, !2481, !2482, !2483, !2484, !2485, !2490, !2491}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !356, file: !357, line: 108, baseType: !77, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !356, file: !357, line: 109, baseType: !361, size: 32, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !362, line: 47, baseType: !363)
!362 = !DIFile(filename: "include/linux/seqlock.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !362, line: 45, size: 32, elements: !364)
!364 = !{!365}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !363, file: !362, line: 46, baseType: !77, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !356, file: !357, line: 110, baseType: !367, size: 128, offset: 64)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !368, line: 37, size: 128, elements: !369)
!368 = !DIFile(filename: "include/linux/list_bl.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!369 = !{!370, !372}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !367, file: !368, line: 38, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !367, file: !368, line: 38, baseType: !373, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !356, file: !357, line: 111, baseType: !355, size: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !356, file: !357, line: 112, baseType: !376, size: 128, offset: 256)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !357, line: 43, size: 128, elements: !377)
!377 = !{!378, !387}
!378 = !DIDerivedType(tag: DW_TAG_member, scope: !376, file: !357, line: 44, baseType: !379, size: 64)
!379 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !376, file: !357, line: 44, size: 64, elements: !380)
!380 = !{!381, !386}
!381 = !DIDerivedType(tag: DW_TAG_member, scope: !379, file: !357, line: 45, baseType: !382, size: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !379, file: !357, line: 45, size: 64, elements: !383)
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !382, file: !357, line: 46, baseType: !142, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !382, file: !357, line: 46, baseType: !142, size: 32, offset: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !379, file: !357, line: 48, baseType: !125, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !376, file: !357, line: 50, baseType: !388, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !356, file: !357, line: 113, baseType: !318, size: 64, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "d_iname", scope: !356, file: !357, line: 115, baseType: !392, size: 256, offset: 448)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 256, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "d_lockref", scope: !356, file: !357, line: 118, baseType: !396, size: 64, offset: 704)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lockref", file: !397, line: 21, size: 64, elements: !398)
!397 = !DIFile(filename: "include/linux/lockref.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, scope: !396, file: !397, line: 22, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !396, file: !397, line: 22, size: 64, elements: !401)
!401 = !{!402, !405}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !400, file: !397, line: 29, baseType: !403, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !404, line: 30, baseType: !127)
!404 = !DIFile(filename: "include/uapi/asm-generic/int-ll64.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!405 = !DIDerivedType(tag: DW_TAG_member, scope: !400, file: !397, line: 32, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !400, file: !397, line: 32, size: 64, elements: !407)
!407 = !{!408, !425}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !406, file: !397, line: 33, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !410, line: 76, baseType: !411)
!410 = !DIFile(filename: "include/linux/spinlock_types.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !410, line: 64, size: 32, elements: !412)
!412 = !{!413}
!413 = !DIDerivedType(tag: DW_TAG_member, scope: !411, file: !410, line: 65, baseType: !414, size: 32)
!414 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !411, file: !410, line: 65, size: 32, elements: !415)
!415 = !{!416}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !414, file: !410, line: 66, baseType: !417, size: 32)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !410, line: 20, size: 32, elements: !418)
!418 = !{!419}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !417, file: !410, line: 21, baseType: !420, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !421, line: 38, baseType: !422)
!421 = !DIFile(filename: "include/asm-generic/qspinlock_types.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qspinlock", file: !421, line: 36, size: 32, elements: !423)
!423 = !{!424}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !422, file: !421, line: 37, baseType: !70, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !406, file: !397, line: 34, baseType: !77, size: 32, offset: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "d_op", scope: !356, file: !357, line: 119, baseType: !427, size: 64, offset: 768)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry_operations", file: !357, line: 148, size: 1024, align: 512, elements: !430)
!430 = !{!431, !435, !436, !443, !452, !456, !460, !461, !465, !470, !2463}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "d_revalidate", scope: !429, file: !357, line: 149, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!75, !355, !77}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "d_weak_revalidate", scope: !429, file: !357, line: 150, baseType: !432, size: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !429, file: !357, line: 151, baseType: !437, size: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!75, !440, !442}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "d_compare", scope: !429, file: !357, line: 152, baseType: !444, size: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!75, !440, !440, !77, !447, !450}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !449)
!449 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !376)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "d_delete", scope: !429, file: !357, line: 154, baseType: !453, size: 64, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!75, !440}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "d_release", scope: !429, file: !357, line: 155, baseType: !457, size: 64, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !355}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "d_prune", scope: !429, file: !357, line: 156, baseType: !457, size: 64, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "d_iput", scope: !429, file: !357, line: 157, baseType: !462, size: 64, offset: 448)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !355, !318}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "d_dname", scope: !429, file: !357, line: 158, baseType: !466, size: 64, offset: 512)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!469, !355, !469, !75}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "d_automount", scope: !429, file: !357, line: 159, baseType: !471, size: 64, offset: 576)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!474, !2154}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !476, line: 66, size: 192, elements: !477)
!476 = !DIFile(filename: "include/linux/mount.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!477 = !{!478, !479, !2462}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_root", scope: !475, file: !476, line: 67, baseType: !355, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_sb", scope: !475, file: !476, line: 68, baseType: !480, size: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !315, line: 1446, size: 9216, elements: !482)
!482 = !{!483, !484, !488, !489, !490, !493, !1996, !2077, !2145, !2276, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2308, !2309, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2352, !2355, !2358, !2359, !2401, !2417, !2419, !2422, !2423, !2424, !2425, !2426, !2427, !2428, !2429, !2430, !2431, !2449, !2450, !2451, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2461}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !481, file: !315, line: 1447, baseType: !118, size: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !481, file: !315, line: 1448, baseType: !485, size: 32, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !71, line: 15, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !71, line: 12, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !404, line: 26, baseType: !77)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !481, file: !315, line: 1449, baseType: !221, size: 8, offset: 160)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !481, file: !315, line: 1450, baseType: !89, size: 64, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !481, file: !315, line: 1451, baseType: !491, size: 64, offset: 256)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !71, line: 45, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !333, line: 87, baseType: !147)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !481, file: !315, line: 1452, baseType: !494, size: 64, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !315, line: 2134, size: 448, elements: !496)
!496 = !{!497, !498, !499, !503, !507, !1984, !1985, !1986, !1989, !1990, !1991, !1993, !1994, !1995}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !495, file: !315, line: 2135, baseType: !447, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !495, file: !315, line: 2136, baseType: !75, size: 32, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !495, file: !315, line: 2150, baseType: !500, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!355, !494, !75, !447, !68}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !495, file: !315, line: 2152, baseType: !504, size: 64, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !480}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !495, file: !315, line: 2153, baseType: !508, size: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !23, line: 252, size: 4480, elements: !510)
!510 = !{!511, !512, !513, !517, !1668, !1694, !1695, !1696, !1697, !1705, !1708, !1709, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1773, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1788, !1789, !1790, !1791, !1800, !1817, !1818, !1819, !1820, !1821, !1822, !1825, !1828, !1829, !1830, !1831, !1832, !1856, !1857, !1859, !1970, !1971, !1972, !1974, !1975, !1976, !1977, !1978}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !509, file: !23, line: 254, baseType: !22, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !509, file: !23, line: 257, baseType: !118, size: 128, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !509, file: !23, line: 260, baseType: !514, size: 448, offset: 192)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 448, elements: !515)
!515 = !{!516}
!516 = !DISubrange(count: 56)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "mkobj", scope: !509, file: !23, line: 263, baseType: !518, size: 704, offset: 640)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_kobject", file: !23, line: 40, size: 704, elements: !519)
!519 = !{!520, !1663, !1664, !1665}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !518, file: !23, line: 41, baseType: !521, size: 512)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !522, line: 61, size: 512, elements: !523)
!522 = !DIFile(filename: "include/linux/kobject.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!523 = !{!524, !525, !526, !528, !566, !646, !1657, !1658, !1659, !1660, !1661, !1662}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !521, file: !522, line: 62, baseType: !447, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !521, file: !522, line: 63, baseType: !118, size: 128, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !521, file: !522, line: 64, baseType: !527, size: 64, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !521, file: !522, line: 65, baseType: !529, size: 64, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !522, line: 161, size: 768, elements: !531)
!531 = !{!532, !533, !534, !535}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !530, file: !522, line: 162, baseType: !118, size: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !530, file: !522, line: 163, baseType: !409, size: 32, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !530, file: !522, line: 164, baseType: !521, size: 512, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !530, file: !522, line: 165, baseType: !536, size: 64, offset: 704)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !522, line: 125, size: 192, elements: !539)
!539 = !{!540, !545, !550}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !538, file: !522, line: 126, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!75, !529, !527}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !538, file: !522, line: 127, baseType: !546, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!447, !529, !527}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !538, file: !522, line: 128, baseType: !551, size: 64, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!75, !529, !527, !555}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !522, line: 118, size: 18496, elements: !557)
!557 = !{!558, !560, !561, !565}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !556, file: !522, line: 119, baseType: !559, size: 2048)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 2048, elements: !393)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !556, file: !522, line: 120, baseType: !75, size: 32, offset: 2048)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !556, file: !522, line: 121, baseType: !562, size: 16384, offset: 2080)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 16384, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 2048)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !556, file: !522, line: 122, baseType: !75, size: 32, offset: 18464)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !521, file: !522, line: 66, baseType: !567, size: 64, offset: 320)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !522, line: 110, size: 320, elements: !569)
!569 = !{!570, !574, !607, !609, !642}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !568, file: !522, line: 111, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !527}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !568, file: !522, line: 112, baseType: !575, size: 64, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !578, line: 174, size: 192, elements: !579)
!578 = !DIFile(filename: "include/linux/sysfs.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!579 = !{!580, !592, !599}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !577, file: !578, line: 175, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!584, !527, !587, !469}
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !71, line: 59, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !333, line: 72, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !333, line: 14, baseType: !66)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !578, line: 29, size: 128, elements: !589)
!589 = !{!590, !591}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !588, file: !578, line: 30, baseType: !447, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !588, file: !578, line: 31, baseType: !322, size: 16, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !577, file: !578, line: 176, baseType: !593, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!584, !527, !587, !447, !596}
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !71, line: 54, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !333, line: 71, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !333, line: 15, baseType: !89)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "rh_reserved_namespace", scope: !577, file: !578, line: 177, baseType: !600, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!603, !527, !605}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !568, file: !522, line: 113, baseType: !608, size: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "child_ns_type", scope: !568, file: !522, line: 114, baseType: !610, size: 64, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!613, !527}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_ns_type_operations", file: !30, line: 41, size: 384, elements: !616)
!616 = !{!617, !618, !622, !628, !632, !636}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !615, file: !30, line: 42, baseType: !29, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "grab_current_ns", scope: !615, file: !30, line: 43, baseType: !619, size: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!68}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "netlink_ns", scope: !615, file: !30, line: 44, baseType: !623, size: 64, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!603, !626}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !30, line: 21, flags: DIFlagFwdDecl)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "initial_ns", scope: !615, file: !30, line: 45, baseType: !629, size: 64, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!603}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "drop_ns", scope: !615, file: !30, line: 46, baseType: !633, size: 64, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !68}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "current_may_mount", scope: !615, file: !30, line: 47, baseType: !637, size: 64, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!640}
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !71, line: 29, baseType: !641)
!641 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !568, file: !522, line: 115, baseType: !643, size: 64, offset: 256)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!603, !527}
!646 = !DIDerivedType(tag: DW_TAG_member, scope: !521, file: !522, line: 67, baseType: !647, size: 64, offset: 384)
!647 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !521, file: !522, line: 67, size: 64, elements: !648)
!648 = !{!649, !1649, !1655}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !647, file: !522, line: 67, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_node", file: !652, line: 112, size: 960, elements: !653)
!652 = !DIFile(filename: "include/linux/kernfs.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!653 = !{!654, !655, !656, !657, !658, !659, !660, !661, !1642, !1643, !1644, !1645, !1646}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !651, file: !652, line: 113, baseType: !70, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !651, file: !652, line: 114, baseType: !70, size: 32, offset: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !651, file: !652, line: 124, baseType: !650, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !651, file: !652, line: 125, baseType: !447, size: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !651, file: !652, line: 127, baseType: !110, size: 192, align: 64, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !651, file: !652, line: 129, baseType: !603, size: 64, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !651, file: !652, line: 130, baseType: !77, size: 32, offset: 448)
!661 = !DIDerivedType(tag: DW_TAG_member, scope: !651, file: !652, line: 131, baseType: !662, size: 256, offset: 512)
!662 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !651, file: !652, line: 131, size: 256, elements: !663)
!663 = !{!664, !1599, !1603}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !662, file: !652, line: 132, baseType: !665, size: 192)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_dir", file: !652, line: 80, size: 192, elements: !666)
!666 = !{!667, !668, !672}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "subdirs", scope: !665, file: !652, line: 81, baseType: !89, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !665, file: !652, line: 83, baseType: !669, size: 64, offset: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !111, line: 43, size: 64, elements: !670)
!670 = !{!671}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !669, file: !111, line: 44, baseType: !115, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !665, file: !652, line: 89, baseType: !673, size: 64, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_root", file: !652, line: 165, size: 896, elements: !675)
!675 = !{!676, !677, !678, !724, !1597, !1598}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "kn", scope: !674, file: !652, line: 167, baseType: !650, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !674, file: !652, line: 168, baseType: !77, size: 32, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ino_ida", scope: !674, file: !652, line: 171, baseType: !679, size: 384, offset: 128)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ida", file: !680, line: 214, size: 384, elements: !681)
!680 = !DIFile(filename: "include/linux/idr.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!681 = !{!682, !715}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "idr", scope: !679, file: !680, line: 215, baseType: !683, size: 320)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "idr", file: !680, line: 39, size: 320, elements: !684)
!684 = !{!685, !709, !710, !711, !712, !713, !714}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "hint", scope: !683, file: !680, line: 40, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "idr_layer", file: !680, line: 30, size: 16896, elements: !688)
!688 = !{!689, !690, !694, !698, !699, !700}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !687, file: !680, line: 31, baseType: !75, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !687, file: !680, line: 32, baseType: !691, size: 256, offset: 64)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 256, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 4)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ary", scope: !687, file: !680, line: 33, baseType: !695, size: 16384, offset: 320)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 16384, elements: !696)
!696 = !{!697}
!697 = !DISubrange(count: 256)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !687, file: !680, line: 34, baseType: !75, size: 32, offset: 16704)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !687, file: !680, line: 35, baseType: !75, size: 32, offset: 16736)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "callback_head", scope: !687, file: !680, line: 36, baseType: !701, size: 128, offset: 16768)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !71, line: 218, size: 128, elements: !702)
!702 = !{!703, !705}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !701, file: !71, line: 219, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !701, file: !71, line: 220, baseType: !706, size: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{null, !704}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !683, file: !680, line: 41, baseType: !686, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "id_free", scope: !683, file: !680, line: 42, baseType: !686, size: 64, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !683, file: !680, line: 43, baseType: !75, size: 32, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "id_free_cnt", scope: !683, file: !680, line: 44, baseType: !75, size: 32, offset: 224)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !683, file: !680, line: 45, baseType: !75, size: 32, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !683, file: !680, line: 46, baseType: !409, size: 32, offset: 288)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "free_bitmap", scope: !679, file: !680, line: 216, baseType: !716, size: 64, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ida_bitmap", file: !680, line: 209, size: 1024, elements: !718)
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "nr_busy", scope: !717, file: !680, line: 210, baseType: !66, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !717, file: !680, line: 211, baseType: !721, size: 960, offset: 64)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 960, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 15)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "syscall_ops", scope: !674, file: !652, line: 172, baseType: !725, size: 64, offset: 512)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_syscall_ops", file: !652, line: 152, size: 320, elements: !727)
!727 = !{!728, !733, !1585, !1589, !1593}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !726, file: !652, line: 153, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!75, !673, !732, !469}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !726, file: !652, line: 154, baseType: !734, size: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!75, !737, !673}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !739, line: 18, size: 1088, elements: !740)
!739 = !DIFile(filename: "include/linux/seq_file.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!740 = !{!741, !742, !743, !744, !745, !746, !747, !748, !770, !792, !793, !1197, !1198}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !738, file: !739, line: 19, baseType: !469, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !738, file: !739, line: 20, baseType: !596, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !738, file: !739, line: 21, baseType: !596, size: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !738, file: !739, line: 22, baseType: !596, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !738, file: !739, line: 23, baseType: !491, size: 64, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !738, file: !739, line: 24, baseType: !491, size: 64, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !738, file: !739, line: 25, baseType: !125, size: 64, offset: 384)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !738, file: !739, line: 26, baseType: !749, size: 320, offset: 448)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !750, line: 51, size: 320, elements: !751)
!750 = !DIFile(filename: "include/linux/mutex.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!751 = !{!752, !753, !754, !755, !756}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !749, file: !750, line: 53, baseType: !70, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !749, file: !750, line: 54, baseType: !409, size: 32, offset: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !749, file: !750, line: 55, baseType: !118, size: 128, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !749, file: !750, line: 57, baseType: !87, size: 64, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, scope: !749, file: !750, line: 60, baseType: !757, size: 64, offset: 256)
!757 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !749, file: !750, line: 60, size: 64, elements: !758)
!758 = !{!759, !764, !768}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "osq", scope: !757, file: !750, line: 60, baseType: !760, size: 32)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "optimistic_spin_queue", file: !761, line: 14, size: 32, elements: !762)
!761 = !DIFile(filename: "include/linux/osq_lock.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!762 = !{!763}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !760, file: !761, line: 19, baseType: !70, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "__UNIQUE_ID_rh_kabi_hide61", scope: !757, file: !750, line: 60, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !757, file: !750, line: 60, size: 64, elements: !766)
!766 = !{!767}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "spin_mlock", scope: !765, file: !750, line: 60, baseType: !68, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, scope: !757, file: !750, line: 60, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !757, file: !750, line: 60, elements: !189)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !738, file: !739, line: 27, baseType: !771, size: 64, offset: 768)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq_operations", file: !739, line: 36, size: 256, elements: !774)
!774 = !{!775, !780, !784, !788}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !773, file: !739, line: 37, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!68, !737, !779}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !773, file: !739, line: 38, baseType: !781, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{null, !737, !68}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !773, file: !739, line: 39, baseType: !785, size: 64, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!68, !737, !68, !779}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !773, file: !739, line: 40, baseType: !789, size: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!75, !737, !68}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "poll_event", scope: !738, file: !739, line: 28, baseType: !75, size: 32, offset: 832)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "user_ns", scope: !738, file: !739, line: 30, baseType: !794, size: 64, offset: 896)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "user_namespace", file: !796, line: 47, size: 3840, elements: !797)
!796 = !DIFile(filename: "include/linux/user_namespace.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!797 = !{!798, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !930, !931, !932, !933, !945, !1193, !1194, !1195}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "uid_map", scope: !795, file: !796, line: 48, baseType: !799, size: 512)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uid_gid_map", file: !796, line: 12, size: 512, elements: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "nr_extents", scope: !799, file: !796, line: 13, baseType: !142, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !799, file: !796, line: 18, baseType: !803, size: 480, offset: 32)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !804, size: 480, elements: !809)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uid_gid_extent", file: !796, line: 14, size: 96, elements: !805)
!805 = !{!806, !807, !808}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !804, file: !796, line: 15, baseType: !142, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "lower_first", scope: !804, file: !796, line: 16, baseType: !142, size: 32, offset: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !804, file: !796, line: 17, baseType: !142, size: 32, offset: 64)
!809 = !{!810}
!810 = !DISubrange(count: 5)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "gid_map", scope: !795, file: !796, line: 49, baseType: !799, size: 512, offset: 512)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "projid_map", scope: !795, file: !796, line: 50, baseType: !799, size: 512, offset: 1024)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !795, file: !796, line: 51, baseType: !70, size: 32, offset: 1536)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !795, file: !796, line: 52, baseType: !794, size: 64, offset: 1600)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !795, file: !796, line: 53, baseType: !326, size: 32, offset: 1664)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !795, file: !796, line: 54, baseType: !335, size: 32, offset: 1696)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "proc_inum", scope: !795, file: !796, line: 55, baseType: !77, size: 32, offset: 1728)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "rh_reserved_may_mount_sysfs", scope: !795, file: !796, line: 56, baseType: !640, size: 8, offset: 1760)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "rh_reserved_may_mount_proc", scope: !795, file: !796, line: 57, baseType: !640, size: 8, offset: 1768)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "persistent_keyring_register", scope: !795, file: !796, line: 61, baseType: !821, size: 64, offset: 1792)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !823, line: 138, size: 1472, elements: !824)
!823 = !DIFile(filename: "include/linux/key.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!824 = !{!825, !826, !830, !835, !863, !866, !867, !874, !875, !876, !877, !880, !881, !882, !883, !899, !910, !928}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !822, file: !823, line: 139, baseType: !70, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !822, file: !823, line: 140, baseType: !827, size: 32, offset: 32)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "key_serial_t", file: !823, line: 31, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !71, line: 102, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !404, line: 25, baseType: !75)
!830 = !DIDerivedType(tag: DW_TAG_member, scope: !822, file: !823, line: 141, baseType: !831, size: 192, offset: 64)
!831 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !822, file: !823, line: 141, size: 192, elements: !832)
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "graveyard_link", scope: !831, file: !823, line: 142, baseType: !118, size: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "serial_node", scope: !831, file: !823, line: 143, baseType: !110, size: 192, align: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !822, file: !823, line: 145, baseType: !836, size: 256, offset: 256)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !837, line: 49, size: 256, elements: !838)
!837 = !DIFile(filename: "include/linux/rwsem.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!838 = !{!839, !855, !857, !858, !862}
!839 = !DIDerivedType(tag: DW_TAG_member, scope: !836, file: !837, line: 50, baseType: !840, size: 64)
!840 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !836, file: !837, line: 50, size: 64, elements: !841)
!841 = !{!842, !849, !853}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !840, file: !837, line: 50, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !844, line: 23, baseType: !845)
!844 = !DIFile(filename: "include/asm-generic/atomic-long.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !71, line: 191, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 189, size: 64, elements: !847)
!847 = !{!848}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !846, file: !71, line: 190, baseType: !66, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "__UNIQUE_ID_rh_kabi_hide51", scope: !840, file: !837, line: 50, baseType: !850, size: 64)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !840, file: !837, line: 50, size: 64, elements: !851)
!851 = !{!852}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !850, file: !837, line: 50, baseType: !66, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, scope: !840, file: !837, line: 50, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !840, file: !837, line: 50, elements: !189)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !836, file: !837, line: 52, baseType: !856, size: 32, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !410, line: 32, baseType: !417)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "osq", scope: !836, file: !837, line: 54, baseType: !760, size: 32, offset: 96)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !836, file: !837, line: 55, baseType: !859, size: 64, offset: 128)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slist_head", file: !837, line: 30, size: 64, elements: !860)
!860 = !{!861}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !859, file: !837, line: 31, baseType: !121, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !836, file: !837, line: 60, baseType: !87, size: 64, offset: 192)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !822, file: !823, line: 146, baseType: !864, size: 64, offset: 512)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "key_user", file: !823, line: 146, flags: DIFlagFwdDecl)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "security", scope: !822, file: !823, line: 147, baseType: !68, size: 64, offset: 576)
!867 = !DIDerivedType(tag: DW_TAG_member, scope: !822, file: !823, line: 148, baseType: !868, size: 64, offset: 640)
!868 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !822, file: !823, line: 148, size: 64, elements: !869)
!869 = !{!870, !873}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "expiry", scope: !868, file: !823, line: 149, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !71, line: 69, baseType: !872)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time_t", file: !333, line: 88, baseType: !586)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "revoked_at", scope: !868, file: !823, line: 150, baseType: !871, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "last_used_at", scope: !822, file: !823, line: 152, baseType: !871, size: 64, offset: 704)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !822, file: !823, line: 153, baseType: !326, size: 32, offset: 768)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !822, file: !823, line: 154, baseType: !335, size: 32, offset: 800)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !822, file: !823, line: 155, baseType: !878, size: 32, offset: 832)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "key_perm_t", file: !823, line: 34, baseType: !879)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !71, line: 108, baseType: !487)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "quotalen", scope: !822, file: !823, line: 156, baseType: !323, size: 16, offset: 864)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "datalen", scope: !822, file: !823, line: 157, baseType: !323, size: 16, offset: 880)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !822, file: !823, line: 167, baseType: !89, size: 64, offset: 896)
!883 = !DIDerivedType(tag: DW_TAG_member, scope: !822, file: !823, line: 187, baseType: !884, size: 192, offset: 960)
!884 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !822, file: !823, line: 187, size: 192, elements: !885)
!885 = !{!886, !894}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "index_key", scope: !884, file: !823, line: 188, baseType: !887, size: 192)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "keyring_index_key", file: !823, line: 86, size: 192, elements: !888)
!888 = !{!889, !892, !893}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !887, file: !823, line: 87, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "key_type", file: !823, line: 81, flags: DIFlagFwdDecl)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !887, file: !823, line: 88, baseType: !447, size: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "desc_len", scope: !887, file: !823, line: 89, baseType: !596, size: 64, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, scope: !884, file: !823, line: 189, baseType: !895, size: 128)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !884, file: !823, line: 189, size: 128, elements: !896)
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !895, file: !823, line: 190, baseType: !890, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !895, file: !823, line: 191, baseType: !469, size: 64, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "type_data", scope: !822, file: !823, line: 203, baseType: !900, size: 128, offset: 1152)
!900 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !822, file: !823, line: 198, size: 128, elements: !901)
!901 = !{!902, !903, !907, !909}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !900, file: !823, line: 199, baseType: !118, size: 128)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !900, file: !823, line: 200, baseType: !904, size: 128)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 128, elements: !905)
!905 = !{!906}
!906 = !DISubrange(count: 2)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !900, file: !823, line: 201, baseType: !908, size: 128)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 128, elements: !905)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "reject_error", scope: !900, file: !823, line: 202, baseType: !75, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, scope: !822, file: !823, line: 209, baseType: !911, size: 128, offset: 1280)
!911 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !822, file: !823, line: 209, size: 128, elements: !912)
!912 = !{!913, !920}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !911, file: !823, line: 215, baseType: !914, size: 128)
!914 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !911, file: !823, line: 210, size: 128, elements: !915)
!915 = !{!916, !917, !918, !919}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !914, file: !823, line: 211, baseType: !89, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "rcudata", scope: !914, file: !823, line: 212, baseType: !68, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !914, file: !823, line: 213, baseType: !68, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "data2", scope: !914, file: !823, line: 214, baseType: !908, size: 128)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !911, file: !823, line: 216, baseType: !921, size: 128)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "assoc_array", file: !922, line: 26, size: 128, elements: !923)
!922 = !DIFile(filename: "include/linux/assoc_array.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!923 = !{!924, !927}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !921, file: !922, line: 27, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DICompositeType(tag: DW_TAG_structure_type, name: "assoc_array_ptr", file: !922, line: 27, flags: DIFlagFwdDecl)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "nr_leaves_on_tree", scope: !921, file: !922, line: 28, baseType: !89, size: 64, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !822, file: !823, line: 219, baseType: !929, size: 16, offset: 1408)
!929 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "persistent_keyring_register_sem", scope: !795, file: !796, line: 62, baseType: !836, size: 256, offset: 1856)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !795, file: !796, line: 64, baseType: !75, size: 32, offset: 2112)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !795, file: !796, line: 65, baseType: !89, size: 64, offset: 2176)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !795, file: !796, line: 66, baseType: !934, size: 256, offset: 2240)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work_struct", file: !935, line: 100, size: 256, elements: !936)
!935 = !DIFile(filename: "include/linux/workqueue.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!936 = !{!937, !938, !939}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !934, file: !935, line: 101, baseType: !843, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !934, file: !935, line: 102, baseType: !118, size: 128, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !934, file: !935, line: 103, baseType: !940, size: 64, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "work_func_t", file: !935, line: 19, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{null, !944}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !795, file: !796, line: 67, baseType: !946, size: 704, offset: 2496)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_table_set", file: !947, line: 160, size: 704, elements: !948)
!947 = !DIFile(filename: "include/linux/sysctl.h", directory: "/diffkemp/kernel/linux-3.10.0-862")
!948 = !{!949, !954}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "is_seen", scope: !946, file: !947, line: 161, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!75, !953}
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !946, file: !947, line: 162, baseType: !955, size: 640, offset: 64)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_dir", file: !947, line: 154, size: 640, elements: !956)
!956 = !{!957, !1192}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !955, file: !947, line: 156, baseType: !958, size: 576)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_table_header", file: !947, line: 135, size: 576, elements: !959)
!959 = !{!960, !999, !1006, !1007, !1183, !1184, !1186}
!960 = !DIDerivedType(tag: DW_TAG_member, scope: !958, file: !947, line: 137, baseType: !961, size: 192)
!961 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !958, file: !947, line: 137, size: 192, elements: !962)
!962 = !{!963, !998}
!963 = !DIDerivedType(tag: DW_TAG_member, scope: !961, file: !947, line: 138, baseType: !964, size: 192)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !961, file: !947, line: 138, size: 192, elements: !965)
!965 = !{!966, !995, !996, !997}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "ctl_table", scope: !964, file: !947, line: 139, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_table", file: !947, line: 115, size: 512, elements: !969)
!969 = !{!970, !971, !972, !973, !974, !975, !981, !993, !994}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "procname", scope: !968, file: !947, line: 117, baseType: !447, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !968, file: !947, line: 118, baseType: !68, size: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !968, file: !947, line: 119, baseType: !75, size: 32, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !968, file: !947, line: 120, baseType: !322, size: 16, offset: 160)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !968, file: !947, line: 121, baseType: !967, size: 64, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "proc_handler", scope: !968, file: !947, line: 122, baseType: !976, size: 64, offset: 256)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "proc_handler", file: !947, line: 39, baseType: !978)
!978 = !DISubroutineType(types: !979)
!979 = !{!75, !967, !75, !68, !980, !779}
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !968, file: !947, line: 123, baseType: !982, size: 64, offset: 320)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
